---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelTextType
source: html/e663c27f-b1af-40c9-d4ac-e65197e4ad55.htm
---
# ModelTextType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.